madeforlotto/app/controllers/lines_controller.rb

  def index
    @lines = Line.all
---
SELECT "lines".* FROM "lines"