madeforlotto/app/controllers/lines_controller.rb

  def loadlines
    @lines = Line.all
---
SELECT "lines".* FROM "lines"

  def create
    @line = Line.new(line_params)

    respond_to do |format|
      if @line.save
---
INSERT INTO "lines" ("line", "created_at", "updated_at") VALUES (?, ?, ?)  [["line", ""], ["created_at", "2023-11-29 14:16:27.453294"], ["updated_at", "2023-11-29 14:16:27.453294"]]

  def update
    respond_to do |format|
      if @line.update(line_params)
---
UPDATE "lines" SET "line" = ?, "updated_at" = ? WHERE "lines"."id" = ?  [["line", "78"], ["updated_at", "2023-11-29 14:16:32.052428"], ["id", 43]]

  def destroy
    @line.destroy
---
DELETE FROM "lines" WHERE "lines"."id" = ?  [["id", 43]]

    def set_line
      @line = Line.find(params[:id])
---
SELECT "lines".* FROM "lines" WHERE "lines"."id" = ? LIMIT ?  [["id", 43], ["LIMIT", 1]]